cf/InformationRegisters/РегионыПартнера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегионыПартнера</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/РегионыПартнераПредставление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегионыПартнераПредставление</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регионы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/РегионыПартнера/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка тогда
		Если Отбор.Найти("Контрагент")=Неопределено Тогда
			Возврат;
		Иначе
			текКонтрагент = Отбор.Контрагент.Значение;
		КонецЕсли;
		
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("Контрагент",текКонтрагент);
		Запрос.Текст="ВЫБРАТЬ
		|	РегионыПартнера.Регион.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.РегионыПартнера КАК РегионыПартнера
		|ГДЕ
		|	РегионыПартнера.Контрагент = &Контрагент";
		
		Выборка=Запрос.Выполнить().Выбрать();
		Стр="";
		Пока выборка.Следующий() Цикл
			Стр= Стр +?(Стр = "","",", ")+ Выборка.Наименование;
		КонецЦикла;	
		
		Запись = РегистрыСведений.РегионыПартнераПредставление.СоздатьМенеджерЗаписи();
		Запись.Партнер 	= текКонтрагент.Партнер;
		Запись.Контрагент 	= текКонтрагент;
		Запись.Регионы 	= Стр;
		
		Попытка
			
			Если ПустаяСтрока(Стр) Тогда 
				Запись.Удалить();
			Иначе
				Запись.Записать();
			КонецЕсли;
			
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи представления регионов контрагентаа
			|" + стрОшибки);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
